broadleaf-framework/overhead_evaluation/ab_normal.log
============================= SUMMARY =============================
Connection Times (ms)
              min    mean[+/-sd] median   max
Round 1:       87    100   8.2    100     123
Round 2:       85    101   7.2    103     112
Round 3:       90    102   6.9    103     122
Round 4:       84    104  16.4    104     164
Round 5:       82    101  10.0    100     143
AVERAGE:      5.6  101.6  9.74    102   132.8

============================= DETAILS =============================

This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        34183 bytes

Concurrency Level:      1
Time taken for tests:   2.999 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      1036620 bytes
HTML transferred:       1025490 bytes
Requests per second:    10.00 [#/sec] (mean)
Time per request:       99.970 [ms] (mean)
Time per request:       99.970 [ms] (mean, across all concurrent requests)
Transfer rate:          337.54 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    87  100   8.2    100     123
Waiting:       40   45   3.7     45      57
Total:         87  100   8.2    100     123

Percentage of the requests served within a certain time (ms)
  50%    100
  66%    103
  75%    103
  80%    105
  90%    109
  95%    119
  98%    123
  99%    123
 100%    123 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        34183 bytes

Concurrency Level:      1
Time taken for tests:   3.039 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      1036620 bytes
HTML transferred:       1025490 bytes
Requests per second:    9.87 [#/sec] (mean)
Time per request:       101.301 [ms] (mean)
Time per request:       101.301 [ms] (mean, across all concurrent requests)
Transfer rate:          333.11 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    85  101   7.2    103     112
Waiting:       39   46   3.6     47      52
Total:         85  101   7.2    103     112

Percentage of the requests served within a certain time (ms)
  50%    103
  66%    105
  75%    105
  80%    107
  90%    111
  95%    111
  98%    112
  99%    112
 100%    112 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        34183 bytes

Concurrency Level:      1
Time taken for tests:   3.068 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      1036620 bytes
HTML transferred:       1025490 bytes
Requests per second:    9.78 [#/sec] (mean)
Time per request:       102.264 [ms] (mean)
Time per request:       102.264 [ms] (mean, across all concurrent requests)
Transfer rate:          329.97 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    89  102   6.9    103     122
Waiting:       40   46   3.5     46      56
Total:         90  102   6.9    103     122

Percentage of the requests served within a certain time (ms)
  50%    103
  66%    105
  75%    107
  80%    107
  90%    110
  95%    112
  98%    122
  99%    122
 100%    122 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        34183 bytes

Concurrency Level:      1
Time taken for tests:   3.110 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      1036620 bytes
HTML transferred:       1025490 bytes
Requests per second:    9.65 [#/sec] (mean)
Time per request:       103.655 [ms] (mean)
Time per request:       103.655 [ms] (mean, across all concurrent requests)
Transfer rate:          325.54 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    84  104  16.4    104     163
Waiting:       38   49  11.0     47      85
Total:         84  104  16.4    104     164

Percentage of the requests served within a certain time (ms)
  50%    104
  66%    106
  75%    107
  80%    109
  90%    122
  95%    144
  98%    164
  99%    164
 100%    164 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        34183 bytes

Concurrency Level:      1
Time taken for tests:   3.018 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      1036620 bytes
HTML transferred:       1025490 bytes
Requests per second:    9.94 [#/sec] (mean)
Time per request:       100.596 [ms] (mean)
Time per request:       100.596 [ms] (mean, across all concurrent requests)
Transfer rate:          335.44 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    82  100  10.0    100     143
Waiting:       37   45   4.4     46      55
Total:         82  101  10.0    100     143

Percentage of the requests served within a certain time (ms)
  50%    100
  66%    101
  75%    103
  80%    105
  90%    109
  95%    109
  98%    143
  99%    143
 100%    143 (longest request)